wiki/2016-06-24-java-CompletionService.html
<!DOCTYPE html>
<html lang="zh">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://bruceasu.github.io/rss.xml"
      title="RSS feed for https://bruceasu.github.io/"/>
<title>Java CompletionService</title>
<meta name="author" content="Bruce">
<meta name="referrer" content="no-referrer">
<link href= "/styles/org-manual.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rel="stylesheet" href="/styles/font.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/post.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/post_mobile.css">
<link rel="stylesheet" media="screen and (min-width: 600px)" href="/styles/navigatebar.css">
<link rel="stylesheet" media="screen and (max-width: 600px)" href="/styles/navigatebar_mobile.css">
<link rel="stylesheet" href="/theme/highlight.css">

</head>
<body>
<div class="navigatebar">
    <div class="navigatebar-button navigatebar-mine">
        <a href="/index.html">Free World</a>
    </div>
    <div class="navigatebar-slogan">
        「生活可以更简单, 欢迎来到我的开源世界」
    </div>
    <div class="navigatebar-button">
        <a href="/index.html">Home</a>
    </div>
    <div class="navigatebar-button">
        <a href="/tags.html">Tags</a>
    </div>
    <div class="navigatebar-button">
        <a href="/rss.xml">Feeds</a>
    </div>
    <div class="navigatebar-button navigatebar-about">
        <a href="/about.html">About</a>
    </div>
</div>

      <div class="content-area">
<div class="title">Java CompletionService</div>
<div class="category-area"><a href="https://bruceasu.github.io/tags.html#java"><div class="category">java</div></a> </div>
<div class="char-counter">2016-06-24</div>
        <div id="content">
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org88acd58">CompletionService</a></li>
<li><a href="#org202754d">自己维护 list 和 CompletionService 的区别：</a></li>
<li><a href="#orga0b8af7">以下是jdk关于CompletionService的简介：</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org88acd58" class="outline-2">
<h2 id="org88acd58">CompletionService</h2>
<div class="outline-text-2" id="text-org88acd58">
<p>
当向 Executor 提交批处理任务时，并且希望在它们完成后获得结果，如果用FutureTask，
你可以循环获取 task，并用 future.get() 去获取结果，但是如果这个 task 没有完成，
你就得阻塞在这里，这个实效性不高，其实在很多场合，其实你拿第一个任务结果时，此时
结果并没有生成并阻塞，其实在阻塞在第一个任务时，第二个 task 的任务已经早就完成了，
显然这种情况用 future task 不合适的，效率也不高。
</p>
</div>
</div>

<div id="outline-container-org202754d" class="outline-2">
<h2 id="org202754d">自己维护 list 和 CompletionService 的区别：</h2>
<div class="outline-text-2" id="text-org202754d">
<ol class="org-ol">
<li>从 list 中遍历的每个 Future 对象并不一定处于完成状态，这时调用 get() 方法就会
被阻塞住，如果系统是设计成每个线程完成后就能根据其结果继续做后面的事，这样对
于处于 list 后面的但是先完成的线程就会增加了额外的等待时间。</li>
<li>而 CompletionService 的实现是维护一个保存 Future 对象的 BlockingQueue。只有当
这个 Future 对象状态是结束的时候，才会加入到这个 Queue 中，take()方法其实就是
Producer-Consumer 中的 Consumer。它会从 Queue 中取出 Future对象，如果 Queue
是空的，就会阻塞在那里，直到有完成的 Future 对象加入到 Queue 中。</li>
</ol>

<p>
CompletionService 采取的是 BlockingQueue&lt;Future&lt;V&gt;&gt; 无界队列来管理 Future。则有
一个线程执行完毕把返回结果放到 BlockingQueue&lt;Future&lt;V&gt;&gt; 里面。就可以通过
completionServcie.take().get() 取出结果。
</p>

<p>
方法区别：
</p>

<ol class="org-ol">
<li>take 方获取并移除表示下一个已完成任务的 Future，如果目前不存在这样的任务，则
等待。&lt;如果需要用到返回值建议用take&gt;</li>
<li>poll 获取并移除表示下一个已完成任务的 Future，如果不存在这样的任务，则返回
null。</li>
</ol>
</div>
</div>

<div id="outline-container-orga0b8af7" class="outline-2">
<h2 id="orga0b8af7">以下是jdk关于CompletionService的简介：</h2>
<div class="outline-text-2" id="text-orga0b8af7">
<p class="verse">
public interface CompletionService&lt;V&gt;<br>
- 将生产新的异步任务与使用已完成任务的结果分离开来的服务。生产者submit 执行的任<br>
&#xa0;&#xa0;务。使用者 take 已完成的任务，并按照完成这些任务的顺序处理它们的结果。例如，<br>
&#xa0;&#xa0;CompletionService 可以用来管理异步 IO ，执行读操作的任务作为程序或系统的一部分<br>
&#xa0;&#xa0;提交，然后，当完成读操作时，会在程序的不同部分执行其他操作，执行操作的顺序可能<br>
&#xa0;&#xa0;与所请求的顺序不同。<br>
- 通常，CompletionService 依赖于一个单独的 Executor 来实际执行任务，在这种情况下，<br>
&#xa0;&#xa0;CompletionService 只管理一个内部完成队列。ExecutorCompletionService 类提供了此<br>
&#xa0;&#xa0;方法的一个实现。<br>
- 内存一致性效果：线程中向 CompletionService 提交任务之前的操作happen-before 该<br>
&#xa0;&#xa0;任务执行的操作，后者依次 happen-before 紧跟在从对应take() 成功返回的操作。<br>
<br>
</p>

<p>
废话少说，直接看代码：
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="font-weight: bold;">package</span> com.lucky.<span style="font-weight: bold; text-decoration: underline;">concurrent</span>;

<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.<span style="font-weight: bold; text-decoration: underline;">Random</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.<span style="font-weight: bold; text-decoration: underline;">concurrent</span>.<span style="font-weight: bold; text-decoration: underline;">Callable</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.<span style="font-weight: bold; text-decoration: underline;">concurrent</span>.<span style="font-weight: bold; text-decoration: underline;">CompletionService</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.<span style="font-weight: bold; text-decoration: underline;">concurrent</span>.<span style="font-weight: bold; text-decoration: underline;">ExecutionException</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.<span style="font-weight: bold; text-decoration: underline;">concurrent</span>.<span style="font-weight: bold; text-decoration: underline;">ExecutorCompletionService</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.<span style="font-weight: bold; text-decoration: underline;">concurrent</span>.<span style="font-weight: bold; text-decoration: underline;">ExecutorService</span>;
<span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">java</span>.<span style="font-weight: bold; text-decoration: underline;">util</span>.<span style="font-weight: bold; text-decoration: underline;">concurrent</span>.<span style="font-weight: bold; text-decoration: underline;">Executors</span>;

<span style="font-weight: bold;">public</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">CompletionServiceDemo</span> {

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Task</span> <span style="font-weight: bold;">implements</span> <span style="font-weight: bold; text-decoration: underline;">Callable</span>&lt;<span style="font-weight: bold; text-decoration: underline;">Integer</span>&gt; {
        <span style="font-weight: bold;">private</span> <span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>;

        <span style="font-weight: bold;">Task</span>(<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span>) {
            <span style="font-weight: bold;">this</span>.i = i;
        }

        <span style="font-weight: bold; text-decoration: underline;">@Override</span>
        <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">Integer</span> <span style="font-weight: bold;">call</span>() <span style="font-weight: bold;">throws</span> <span style="font-weight: bold; text-decoration: underline;">Exception</span> {
            Thread.sleep(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Random</span>().nextInt(5000));
            System.out.println(Thread.currentThread().getName() + <span style="font-style: italic;">"   "</span> + i);
            <span style="font-weight: bold;">return</span> i;
        }
    }

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">run</span>() {
        <span style="font-weight: bold; text-decoration: underline;">ExecutorService</span> <span style="font-weight: bold; font-style: italic;">pool</span> = Executors.newFixedThreadPool(10);
        <span style="font-weight: bold; text-decoration: underline;">CompletionService</span>&lt;<span style="font-weight: bold; text-decoration: underline;">Integer</span>&gt; <span style="font-weight: bold; font-style: italic;">completionServcie</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">ExecutorCompletionService</span>&lt;<span style="font-weight: bold; text-decoration: underline;">Integer</span>&gt;(
            pool);
        <span style="font-weight: bold;">try</span> {
            <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; 10; i++) {
                completionServcie.submit(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">CompletionServiceDemo</span>.<span style="font-weight: bold; text-decoration: underline;">Task</span>(i));
            }
            <span style="font-weight: bold;">for</span> (<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold; font-style: italic;">i</span> = 0; i &lt; 10; i++) {
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">take &#26041;&#27861;&#31561;&#24453;&#19979;&#19968;&#20010;&#32467;&#26524;&#24182;&#36820;&#22238; Future &#23545;&#35937;&#12290;</span>
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">poll &#19981;&#31561;&#24453;&#65292;&#26377;&#32467;&#26524;&#23601;&#36820;&#22238;&#19968;&#20010; Future &#23545;&#35937;&#65292;&#21542;&#21017;&#36820;&#22238; null&#12290;</span>
                System.out.println(completionServcie.take().get());
            }
        } <span style="font-weight: bold;">catch</span> (<span style="font-weight: bold; text-decoration: underline;">InterruptedException</span> <span style="font-weight: bold; font-style: italic;">e</span>) {
            e.printStackTrace();
        } <span style="font-weight: bold;">catch</span> (<span style="font-weight: bold; text-decoration: underline;">ExecutionException</span> <span style="font-weight: bold; font-style: italic;">e</span>) {
            e.printStackTrace();
        } <span style="font-weight: bold;">finally</span> {
            pool.shutdown();
        }
    }

    <span style="font-weight: bold;">public</span> <span style="font-weight: bold;">static</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">main</span>(<span style="font-weight: bold; text-decoration: underline;">String</span>[] <span style="font-weight: bold; font-style: italic;">args</span>) {
        <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">CompletionServiceDemo</span>().run();
    }
}
</pre>
</div>

<p>
从结果中不难看出。只要有一个线程执行完毕后，主程序就立马获取结果。
</p>
</div>
</div>

        </div>    </div>
    <div id="postamble" class="status"><div id="archive" style="padding-top: 3em; padding-bottom: 2em;"><a href="/archive.html">其它文章</a></div><script src="/js/av-min-1.5.0.js"></script>    </div>
</body>
</html>
